In [1]:
import pandas as pd

## Importação dos arquivos e armazenamentode conteúdo

In [18]:
url = 'dataset2/alunos.csv'
dados = pd.read_csv(url)

### Visualizar as 7 primeiras linhas.

In [19]:
dados.head(7)

                   DataSet:
Nome  Idade Notas  Aprovado
Ary   20    7.5        True
Ana   18    NaN       False
Cátia 27    2.5       False
Denis 18    5.0       False
Beto  21    10.0       True
Bruna 23    NaN       False

### Visualizar as 5 últimas linhas

In [20]:
dados.tail(5)

              DataSet:
Mirla  25 9.0     True
Paulo  37 NaN    False
Mylena 29 7.0     True
Lucas  33 NaN    False
Nadia  34 8.0     True

### Quantidade de linhas do DataFrame

In [21]:
dados.shape

(19, 1)

### Quantidade de Colunas do DataFrame

In [22]:
dados.columns

Index(['DataSet:'], dtype='object')

### Tipos de dados que as colunas possuem.

In [23]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 19 entries, ('Nome', 'Idade', 'Notas') to ('Nadia', '34', '8.0')
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DataSet:  19 non-null     object
dtypes: object(1)
memory usage: 2.0+ KB